results/run-100vu.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: script.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 100 looping VUs for 1m0s (gracefulStop: 30s)


running (0m00.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 100 VUs  0m00.9s/1m0s

running (0m01.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 100 VUs  0m01.9s/1m0s

running (0m02.9s), 100/100 VUs, 100 complete and 0 interrupted iterations
default   [   5% ] 100 VUs  0m02.9s/1m0s

running (0m03.9s), 100/100 VUs, 194 complete and 0 interrupted iterations
default   [   7% ] 100 VUs  0m03.9s/1m0s

running (0m04.9s), 100/100 VUs, 293 complete and 0 interrupted iterations
default   [   8% ] 100 VUs  0m04.9s/1m0s

running (0m05.9s), 100/100 VUs, 300 complete and 0 interrupted iterations
default   [  10% ] 100 VUs  0m05.9s/1m0s

running (0m06.9s), 100/100 VUs, 393 complete and 0 interrupted iterations
default   [  12% ] 100 VUs  0m06.9s/1m0s

running (0m07.9s), 100/100 VUs, 493 complete and 0 interrupted iterations
default   [  13% ] 100 VUs  0m07.9s/1m0s

running (0m08.9s), 100/100 VUs, 590 complete and 0 interrupted iterations
default   [  15% ] 100 VUs  0m08.9s/1m0s

running (0m09.9s), 100/100 VUs, 598 complete and 0 interrupted iterations
default   [  17% ] 100 VUs  0m09.9s/1m0s

running (0m10.9s), 100/100 VUs, 690 complete and 0 interrupted iterations
default   [  18% ] 100 VUs  0m10.9s/1m0s

running (0m11.9s), 100/100 VUs, 790 complete and 0 interrupted iterations
default   [  20% ] 100 VUs  0m11.9s/1m0s

running (0m12.9s), 100/100 VUs, 883 complete and 0 interrupted iterations
default   [  22% ] 100 VUs  0m12.9s/1m0s

running (0m13.9s), 100/100 VUs, 981 complete and 0 interrupted iterations
default   [  23% ] 100 VUs  0m13.9s/1m0s

running (0m14.9s), 100/100 VUs, 996 complete and 0 interrupted iterations
default   [  25% ] 100 VUs  0m14.9s/1m0s

running (0m15.9s), 100/100 VUs, 1085 complete and 0 interrupted iterations
default   [  27% ] 100 VUs  0m15.9s/1m0s

running (0m16.9s), 100/100 VUs, 1180 complete and 0 interrupted iterations
default   [  28% ] 100 VUs  0m16.9s/1m0s

running (0m17.9s), 100/100 VUs, 1275 complete and 0 interrupted iterations
default   [  30% ] 100 VUs  0m17.9s/1m0s

running (0m18.9s), 100/100 VUs, 1296 complete and 0 interrupted iterations
default   [  32% ] 100 VUs  0m18.9s/1m0s

running (0m19.9s), 100/100 VUs, 1385 complete and 0 interrupted iterations
default   [  33% ] 100 VUs  0m19.9s/1m0s

running (0m20.9s), 100/100 VUs, 1483 complete and 0 interrupted iterations
default   [  35% ] 100 VUs  0m20.9s/1m0s

running (0m21.9s), 100/100 VUs, 1576 complete and 0 interrupted iterations
default   [  37% ] 100 VUs  0m21.9s/1m0s

running (0m22.9s), 100/100 VUs, 1654 complete and 0 interrupted iterations
default   [  38% ] 100 VUs  0m22.9s/1m0s

running (0m23.9s), 100/100 VUs, 1691 complete and 0 interrupted iterations
default   [  40% ] 100 VUs  0m23.9s/1m0s

running (0m24.9s), 100/100 VUs, 1782 complete and 0 interrupted iterations
default   [  42% ] 100 VUs  0m24.9s/1m0s

running (0m25.9s), 100/100 VUs, 1878 complete and 0 interrupted iterations
default   [  43% ] 100 VUs  0m25.9s/1m0s

running (0m26.9s), 100/100 VUs, 1972 complete and 0 interrupted iterations
default   [  45% ] 100 VUs  0m26.9s/1m0s

running (0m27.9s), 100/100 VUs, 1994 complete and 0 interrupted iterations
default   [  47% ] 100 VUs  0m27.9s/1m0s

running (0m28.9s), 100/100 VUs, 2083 complete and 0 interrupted iterations
default   [  48% ] 100 VUs  0m28.9s/1m0s

running (0m29.9s), 100/100 VUs, 2182 complete and 0 interrupted iterations
default   [  50% ] 100 VUs  0m29.9s/1m0s

running (0m30.9s), 100/100 VUs, 2275 complete and 0 interrupted iterations
default   [  52% ] 100 VUs  0m30.9s/1m0s

running (0m31.9s), 100/100 VUs, 2345 complete and 0 interrupted iterations
default   [  53% ] 100 VUs  0m31.9s/1m0s

running (0m32.9s), 100/100 VUs, 2391 complete and 0 interrupted iterations
default   [  55% ] 100 VUs  0m32.9s/1m0s

running (0m33.9s), 100/100 VUs, 2482 complete and 0 interrupted iterations
default   [  57% ] 100 VUs  0m33.9s/1m0s

running (0m34.9s), 100/100 VUs, 2578 complete and 0 interrupted iterations
default   [  58% ] 100 VUs  0m34.9s/1m0s

running (0m35.9s), 100/100 VUs, 2671 complete and 0 interrupted iterations
default   [  60% ] 100 VUs  0m35.9s/1m0s

running (0m36.9s), 100/100 VUs, 2693 complete and 0 interrupted iterations
default   [  62% ] 100 VUs  0m36.9s/1m0s

running (0m37.9s), 100/100 VUs, 2783 complete and 0 interrupted iterations
default   [  63% ] 100 VUs  0m37.9s/1m0s

running (0m38.9s), 100/100 VUs, 2882 complete and 0 interrupted iterations
default   [  65% ] 100 VUs  0m38.9s/1m0s

running (0m39.9s), 100/100 VUs, 2975 complete and 0 interrupted iterations
default   [  67% ] 100 VUs  0m39.9s/1m0s

running (0m40.9s), 100/100 VUs, 3015 complete and 0 interrupted iterations
default   [  68% ] 100 VUs  0m40.9s/1m0s

running (0m41.9s), 100/100 VUs, 3091 complete and 0 interrupted iterations
default   [  70% ] 100 VUs  0m41.9s/1m0s

running (0m42.9s), 100/100 VUs, 3183 complete and 0 interrupted iterations
default   [  72% ] 100 VUs  0m42.9s/1m0s

running (0m43.9s), 100/100 VUs, 3274 complete and 0 interrupted iterations
default   [  73% ] 100 VUs  0m43.9s/1m0s

running (0m44.9s), 100/100 VUs, 3365 complete and 0 interrupted iterations
default   [  75% ] 100 VUs  0m44.9s/1m0s

running (0m45.9s), 100/100 VUs, 3396 complete and 0 interrupted iterations
default   [  77% ] 100 VUs  0m45.9s/1m0s

running (0m46.9s), 100/100 VUs, 3482 complete and 0 interrupted iterations
default   [  78% ] 100 VUs  0m46.9s/1m0s

running (0m47.9s), 100/100 VUs, 3579 complete and 0 interrupted iterations
default   [  80% ] 100 VUs  0m47.9s/1m0s

running (0m48.9s), 100/100 VUs, 3669 complete and 0 interrupted iterations
default   [  82% ] 100 VUs  0m48.9s/1m0s

running (0m49.9s), 100/100 VUs, 3719 complete and 0 interrupted iterations
default   [  83% ] 100 VUs  0m49.9s/1m0s

running (0m50.9s), 100/100 VUs, 3789 complete and 0 interrupted iterations
default   [  85% ] 100 VUs  0m50.9s/1m0s

running (0m51.9s), 100/100 VUs, 3880 complete and 0 interrupted iterations
default   [  87% ] 100 VUs  0m51.9s/1m0s

running (0m52.9s), 100/100 VUs, 3968 complete and 0 interrupted iterations
default   [  88% ] 100 VUs  0m52.9s/1m0s

running (0m53.9s), 100/100 VUs, 4038 complete and 0 interrupted iterations
default   [  90% ] 100 VUs  0m53.9s/1m0s

running (0m54.9s), 100/100 VUs, 4102 complete and 0 interrupted iterations
default   [  92% ] 100 VUs  0m54.9s/1m0s

running (0m55.9s), 100/100 VUs, 4182 complete and 0 interrupted iterations
default   [  93% ] 100 VUs  0m55.9s/1m0s

running (0m56.9s), 100/100 VUs, 4277 complete and 0 interrupted iterations
default   [  95% ] 100 VUs  0m56.9s/1m0s

running (0m57.9s), 100/100 VUs, 4361 complete and 0 interrupted iterations
default   [  97% ] 100 VUs  0m57.9s/1m0s

running (0m58.9s), 100/100 VUs, 4420 complete and 0 interrupted iterations
default   [  98% ] 100 VUs  0m58.9s/1m0s

running (0m59.9s), 100/100 VUs, 4483 complete and 0 interrupted iterations
default   [ 100% ] 100 VUs  0m59.9s/1m0s

running (1m00.9s), 003/100 VUs, 4580 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  1m0s


  █ TOTAL RESULTS 

    checks_total.......: 4583    74.981019/s
    checks_succeeded...: 100.00% 4583 out of 4583
    checks_failed......: 0.00%   0 out of 4583

    ✓ status 200 байна

    HTTP
    http_req_duration..............: avg=149.7ms min=53.02ms med=218.51ms max=1.91s p(90)=233.14ms p(95)=250.52ms
      { expected_response:true }...: avg=149.7ms min=53.02ms med=218.51ms max=1.91s p(90)=233.14ms p(95)=250.52ms
    http_req_failed................: 0.00%  0 out of 9166
    http_reqs......................: 9166   149.962039/s

    EXECUTION
    iteration_duration.............: avg=1.31s   min=1.27s   med=1.28s    max=3s    p(90)=1.31s    p(95)=1.4s    
    iterations.....................: 4583   74.981019/s
    vus............................: 3      min=3         max=100
    vus_max........................: 100    min=100       max=100

    NETWORK
    data_received..................: 18 MB  287 kB/s
    data_sent......................: 763 kB 13 kB/s



running (1m01.1s), 000/100 VUs, 4583 complete and 0 interrupted iterations
default ✓ [ 100% ] 100 VUs  1m0s